# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
kpt_shape: [17, 3]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512, 0] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, FCM_3, [128]]
  - [-1, 1, Down, [256]]
  - [-1, 1, FCM_2, [256]]
  - [-1, 1, Down, [512]]
  - [-1, 1, FCM_1, [512]]
  - [-1, 1, Pzconv, [512]]
  - [-1, 1, FCM, [512]]
  - [-1, 1, SPPF, [512, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]

  - [-1, 1, Down, [256]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Down, [512]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [[18, 21], 1, Pose, [nc, kpt_shape]]  # Detect(P3, P4, P5)
