# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # dont change this otherwise InvertedResidual will be affected
width_multiple: 1.0  # dont change this otherwise InvertedResidual will be affected

# YOLOv5 backbone
backbone:
  # MobileNetV3-small
  # [from, number, mobilev3_bneck module, [in, out, filter, hidden, stride, use_se, use_hs]]
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 3, 2]],  # 0-P1/2
   [-1, 1, mobilev3_bneck, [16,  16, 3, 2, 1, 0]],  # 1-p2/4
   [-1, 1, mobilev3_bneck, [24,  72, 3, 2, 0, 0]],  # 2-p3/8
   [-1, 1, mobilev3_bneck, [24,  88, 3, 1, 0, 0]],  # 3-p3/8
   [-1, 1, mobilev3_bneck, [40,  96, 5, 2, 1, 1]],  # 4-p4/16
   [-1, 1, mobilev3_bneck, [40, 240, 5, 1, 1, 1]],  # 5-p4/16
   [-1, 1, mobilev3_bneck, [40, 240, 5, 1, 1, 1]],  # 6-p4/16
   [-1, 1, mobilev3_bneck, [48, 120, 5, 1, 1, 1]],  # 7-p4/16
   [-1, 1, mobilev3_bneck, [48, 144, 5, 1, 1, 1]],  # 8-p4/16
   [-1, 1, mobilev3_bneck, [96, 288, 5, 2, 1, 1]],  # 9-p5/32
   [-1, 1, mobilev3_bneck, [96, 576, 5, 1, 1, 1]],  # 10-p5/32
   [-1, 1, mobilev3_bneck, [96, 576, 5, 1, 1, 1]],  # 11-p5/32
  ]

# v8Lite-s head
head:
  [[-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C2f, [256]],  # 14

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C2f, [128]],  # 17 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 17], 1, Concat, [1]],  # cat head P4
   [-1, 1, C2f, [256]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P5
   [-1, 1, C2f, [512]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Pose, [nc, kpt_shape]],  # Detect(P3, P4, P5)
  ]