# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
kpt_shape: [17, 3]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
  t: [0.33, 0.375, 1024, 0]
  s: [0.33, 0.50, 1024, 0]
  m: [0.67, 0.75, 768, 0]
  l: [1.00, 1.00, 512, 0]
  x: [1.00, 1.25, 512, 0]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [768, 3, 2]]  # 7-P5/16
  - [-1, 3, C2f, [768, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P6/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, Conv, [1280, 3, 2]]  # 11-P7/32
  - [-1, 3, C2f, [1280, True]]
  - [-1, 1, SPPF, [1280, 5]]  # 13

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 10], 1, Concat, [1]]  # cat backbone P6
  - [-1, 3, C2, [1024, False]]  # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P5
  - [-1, 3, C2, [768, False]]  # 19

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2, [512]]  # 22

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2, [256]]  # 25 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 22], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2, [512]]  # 28 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 19], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2, [768]]  # 31 (P5/32-large)

  - [-1, 1, Conv, [768, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]  # cat head P6
  - [-1, 3, C2, [1024]]  # 34 (P6/32-large)

  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P7
  - [-1, 3, C2, [1280]]  # 37 (P7/32-large)

  - [[25, 28, 31, 34, 37], 1, Pose, [nc, kpt_shape]]  # Detect(P3, P4, P5)
