# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv7 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]], # 4
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 9-P3/8  
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]], # 10
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 14-P4/16  
   [-1, 1, RepNCSPELAN4, [1024, 512, 256, 1]], # 15
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 20-P5/32  
   [-1, 1, RepNCSPELAN4, [1024, 512, 256, 1]], # 21
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 22
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [15, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]], # 27
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [10, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]], # 32
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 27], 1, Concat, [1]],
   
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]], # 38
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 22], 1, Concat, [1]], 
   
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]], # 44

   [32, 1, RepConv_v7, [256, 3, 1]],
   [38, 1, RepConv_v7, [512, 3, 1]],
   [44, 1, RepConv_v7, [1024, 3, 1]],

   [[45, 46, 47], 1, IOBB, [nc, 1]],   # IOBB(P3, P4, P5)
  ]