# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv7 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
activation: nn.LeakyReLU(0.1) # (optional) model default activation function
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2]],  # 0-P1/2  
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4    
   
   [-1, 1, Conv, [32, 1, 1]],
   [-2, 1, Conv, [32, 1, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1]],  # 7 Yolov7_Tiny_E_ELAN
   
   [-1, 1, MP, []],  # 8-P3/8
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  # 14 Yolov7_Tiny_E_ELAN
   
   [-1, 1, MP, []],  # 15-P4/16
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 21 Yolov7_Tiny_E_ELAN
   
   [-1, 1, MP, []],  # 22-P5/32
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 28 Yolov7_Tiny_E_ELAN
  ]

# yolov7-tiny head
head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 37, 34

   [[7, 14, 21, 37], 1, SimFusion_4in, []], # 38
   [-1, 1, IFM, [[64, 32]]], # 39
  
   [37, 1, Conv, [256, 1, 1]], # 40
   [[14, 21, -1], 1, SimFusion_3in, [256]], # 41
   [[-1, 39], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 0]], # 42
   
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  # 48, 43 Yolov7_Tiny_E_ELAN
  
   [21, 1, Conv, [128, 1, 1]], # 49
   [[7, 14, -1], 1, SimFusion_3in, [128]], # 50
   [[-1, 39], 1, InjectionMultiSum_Auto_pool, [128, [64, 32], 1]], # 51
   
   [-1, 1, Conv, [32, 1, 1]],
   [-2, 1, Conv, [32, 1, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1]],  # 57, 52 Yolov7_Tiny_E_ELAN

   [[57, 48, 37], 1, PyramidPoolAgg, [352, 2]], # 58
   [-1, 1, TopBasicLayer, [352, [64, 128]]], # 59
   
   [[57, 49], 1, AdvPoolFusion, []], # 60
   [[-1, 59], 1, InjectionMultiSum_Auto_pool, [128, [64, 128], 0]], # 61
   
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  # 67, 62 Yolov7_Tiny_E_ELAN
   
   [[-1, 40], 1, AdvPoolFusion, []], # 68
   [[-1, 59], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 1]], # 69
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 75, 70 Yolov7_Tiny_E_ELAN
      
   [57, 1, Conv, [128, 3, 1]], # 76-P3
   [67, 1, Conv, [256, 3, 1]], # 77-P4
   [75, 1, Conv, [512, 3, 1]], # 78-P5

   [[76, 77, 78], 1, IOBB, [nc, 1]],   # IOBB(P3, P4, P5)
  ]
