# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOR object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # expand model depth
width_multiple: 1.25  # expand layer channels

# CSP-Darknet backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ReOrg, []],  # 0
   [-1, 1, Conv, [64, 3, 1]],  # 1-P1/2
   [-1, 1, DownC, [128]],  # 2-P2/4
   [-1, 3, BottleneckCSPA, [128]],
   [-1, 1, DownC, [256]],  # 4-P3/8
   [-1, 7, BottleneckCSPA, [256]],
   [-1, 1, DownC, [512]],  # 6-P4/16
   [-1, 7, BottleneckCSPA, [512]],
   [-1, 1, DownC, [768]], # 8-P5/32
   [-1, 3, BottleneckCSPA, [768]],
   [-1, 1, DownC, [1024]], # 10-P6/64
   [-1, 3, BottleneckCSPA, [1024]],  # 11
  ]

# CSP-Dark-PAN head
head:
  [[-1, 1, Classify, [nc]],  # Classify
  ]