# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv6 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/models/yolov6

# Parameters
nc: 80  # number of classes
kpt_shape: [17, 3]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
activation: nn.ReLU()  # (optional) model default activation function
scales: # model compound scaling constants, i.e. 'model=yolov6n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
  t: [0.33, 0.375, 1024, 0]
  s: [0.33, 0.50, 1024, 0]
  m: [0.67, 0.75, 768, 0]
  l: [1.00, 1.00, 512, 0]
  x: [1.00, 1.25, 512, 0]

# YOLOv6-4.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, RepVGGBlock, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, RepVGGBlock, [128, 3, 2]]  # 1-P2/4
  - [-1, 6, RepBlock, [128]]
  - [-1, 1, RepVGGBlock, [256, 3, 2]]  # 3-P3/8
  - [-1, 12, RepBlock, [256]]
  - [-1, 1, RepVGGBlock, [512, 3, 2]]  # 5-P4/16
  - [-1, 18, RepBlock, [512]]
  - [-1, 1, RepVGGBlock, [1024, 3, 2]]  # 7-P5/32
  - [-1, 6, RepBlock, [1024]]
  - [-1, 1, SimSPPF, [1024, 5]]  # 9

# YOLOv6-4.0s head
head:
  - [-1, 1, SimConv, [256, 1, 1]]
  - [-1, 1, Transpose, [256]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 12, RepBlock, [256]] # 13

  - [-1, 1, SimConv, [128, 1, 1]]
  - [-1, 1, Transpose, [128]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 12, RepBlock, [128]] # 17

  - [-1, 1, SimConv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  # cat head P4
  - [-1, 12, RepBlock, [256]] # 20

  - [-1, 1, SimConv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 12, RepBlock, [512]] # 23
  - [-1, 1, SEAttention, [1024]]

  - [17, 1, Conv, [128, 3, 1]]    #if use_dfl is False, please set reg_max to 0
  - [20, 1, Conv, [256, 3, 1]]
  - [24, 1, Conv, [512, 3, 1]]

  - [[25, 26, 27], 1, Pose, [nc, kpt_shape]]  # Detect(P3, P4, P5)
