# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv7 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
activation: nn.LeakyReLU(0.1) # (optional) model default activation function
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1]],  # 0-P1/2  
  
   [-1, 1, Conv, [64, 3, 2, None, 1]],  # 1-P2/4    

   [-1, 1, Yolov7_Tiny_E_ELAN, [64, 1, 1, None, 1]], # 2

   [-1, 1, MP, []],  # 3-P3/8
   [-1, 1, Yolov7_Tiny_E_ELAN, [128, 1, 1, None, 1]], # 4

   [-1, 1, MP, []],  # 5-P4/16
   [-1, 1, Yolov7_Tiny_E_ELAN, [256, 1, 1, None, 1]], # 6

   [-1, 1, MP, []],  # 7-P5/32
   [-1, 1, Yolov7_Tiny_E_ELAN, [512, 1, 1, None, 1]], # 8
  ]

# yolov7-tiny head
head:
  [[-1, 1, Yolov7_Tiny_SPP, [256]], # 9-Yolov7-tiny-spp
   [[2, 4, 6, 9], 1, SimFusion_4in, []], # 10
   [-1, 1, IFM, [[64, 32]]], # 11
   
   [9, 1, Conv, [256, 1, 1]], # 12
   [[4, 6, -1], 1, SimFusion_3in, [256]], # 13
   [[-1, 11], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 0]], # 14
   [-1, 1, Yolov7_Tiny_E_ELAN, [128, 1, 1, None, 1]], # 15

   [6, 1, Conv, [128, 1, 1]], # 16
   [[2, 4, -1], 1, SimFusion_3in, [128]], # 17
   [[-1, 11], 1, InjectionMultiSum_Auto_pool, [128, [64, 32], 1]], # 18
   [-1, 1, Yolov7_Tiny_E_ELAN, [64, 1, 1, None, 1]], # 19

   [[19, 15, 9], 1, PyramidPoolAgg, [352, 2]], # 20
   [-1, 1, TopBasicLayer, [352, [64, 128]]], # 21

   [[19, 16], 1, AdvPoolFusion, []], # 22
   [[-1, 21], 1, InjectionMultiSum_Auto_pool, [128, [64, 128], 0]], # 23
   [-1, 1, Yolov7_Tiny_E_ELAN, [128, 1, 1, None, 1]], # 24

   [[-1, 12], 1, AdvPoolFusion, []], # 25
   [[-1, 21], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 1]], # 26
   [-1, 1, Yolov7_Tiny_E_ELAN, [256, 1, 1, None, 1]], # 27

   [19, 1, Conv, [128, 3, 1, None, 1]], # 28-P3
   [24, 1, Conv, [256, 3, 1, None, 1]], # 29-P4
   [27, 1, Conv, [512, 3, 1, None, 1]], # 30-P5

   [[28, 29, 30], 1, IDetect, [nc]] # 28
  ]
