# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv7 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Yolov7_E_ELAN, [256, 64, 1, 1, None, 1, [-1, -3, -5, -6]]], # 4
         
   [-1, 1, V7DownSampling, [128]],  # 5-P3/8  
   [-1, 1, Yolov7_E_ELAN, [512, 128, 1, 1, None, 1, [-1, -3, -5, -6]]], # 6
         
   [-1, 1, V7DownSampling, [256]],  # 7-P4/16  
   [-1, 1, Yolov7_E_ELAN, [1024, 256, 1, 1, None, 1, [-1, -3, -5, -6]]], # 8
         
   [-1, 1, V7DownSampling, [512]],  # 9-P5/32  
   [-1, 1, Yolov7_E_ELAN, [1024, 256, 1, 1, None, 1, [-1, -3, -5, -6]]],  # 10
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 11-Yolov7-tiny-spp
   [[4, 6, 8, 11], 1, SimFusion_4in, []], # 12
   [-1, 1, IFM, [[64, 32]]], # 13
   
   [11, 1, Conv, [1024, 1, 1]], # 14
   [[6, 8, -1], 1, SimFusion_3in, [256]], # 15
   [[-1, 13], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 0]], # 16
   [-1, 1, Yolov7_E_ELAN_NECK, [256, 128, 1, 1, None, 1, [-1, -2, -3, -4, -5, -6], False]], # 17

   [8, 1, Conv, [128, 1, 1]], # 18
   [[4, 6, -1], 1, SimFusion_3in, [128]], # 19
   [[-1, 13], 1, InjectionMultiSum_Auto_pool, [128, [64, 32], 1]], # 20
   [-1, 1, Yolov7_E_ELAN_NECK, [128, 64, 1, 1, None, 1, [-1, -2, -3, -4, -5, -6], False]], # 21

   [[21, 17, 11], 1, PyramidPoolAgg, [352, 2]], # 22
   [-1, 1, TopBasicLayer, [352, [64, 128]]], # 23

   [[21, 18], 1, AdvPoolFusion, []], # 24
   [[-1, 23], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]], # 25
   [-1, 1, Yolov7_E_ELAN_NECK, [256, 128, 1, 1, None, 1, [-1, -2, -3, -4, -5, -6], False]], # 26

   [[-1, 14], 1, AdvPoolFusion, []], # 27
   [[-1, 23], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]], # 28
   [-1, 1, Yolov7_E_ELAN_NECK, [512, 256, 1, 1, None, 1, [-1, -2, -3, -4, -5, -6], False]], # 29

   [21, 1, RepConv_v7, [256, 3, 1]], # 30-P3
   [26, 1, RepConv_v7, [512, 3, 1]], # 31-P4
   [29, 1, RepConv_v7, [1024, 3, 1]], # 32-P5

   [[30, 31, 32], 1, IDetect, [nc]] # 33
  ]