# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
  t: [0.33, 0.375, 1024, 0]
  s: [0.33, 0.50, 1024, 0]
  m: [0.67, 0.75, 768, 0]
  l: [1.00, 1.00, 512, 0]
  x: [1.00, 1.25, 512, 0]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, VanillaStem, [64, 4, 4, None, 1]]  # 0-P1/4
  - [-1, 1, VanillaBlock, [256, 1, 2, None, 1]]  # 1-P2/8
  - [-1, 1, VanillaBlock, [512, 1, 2, None, 1]]  # 2-P3/16
  - [-1, 1, VanillaBlock, [1024, 1, 2, None, 1]]  # 3-P4/32

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 6

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 9 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 6], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 12 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 3], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 15 (P5/32-large)

  - [[9, 12, 15], 1, Detect, [nc]]  # Detect(P3, P4, P5)
