# YOLOv8 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
  t: [0.33, 0.375, 1024, 0]
  s: [0.33, 0.50, 1024, 0]
  m: [0.67, 0.75, 768, 0]
  l: [1.00, 1.00, 512, 0]
  x: [1.33, 1.25, 512, 0]

# YOLOv8 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 6, MobileOne, [128, 4, 1, False]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, MobileOne, [256, 4, 1, False]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 6, MobileOne, [512, 4, 1, False]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 6, MobileOne, [1024, 4, 1, False]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv8 head
head:
  [[-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C2f, [512]],  # 12

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C2f, [256]],  # 15 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P4
   [-1, 3, C2f, [512]],  # 18 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 9], 1, Concat, [1]],  # cat head P5
   [-1, 3, C2f, [1024]],  # 21 (P5/32-large)

   [[15, 18, 21], 1, Detect, [nc]],  # Detect(P3, P4, P5)
  ]
