# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
  t: [0.33, 0.375, 1024, 0]
  s: [0.33, 0.50, 1024, 0]
  m: [0.67, 0.75, 768, 0]
  l: [1.00, 1.00, 512, 0]
  x: [1.00, 1.25, 512, 0]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f_UIB, [256, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_UIB, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_UIB, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f_UIB, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, DiTBlock, []] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-1, 1, Conv, [1024, 1]] # 12 P5
  - [6, 1, Conv, [512, 1]] # 13 P4
  - [4, 1, ADown, [256]] # P3
  - [[-1, 12, 13], 1, Concat, [1]] # 15
  - [-1, 1, DWConv, [512, 5]] 
  - [-2, 1, DWConv, [512, 7]]
  - [-3, 1, DWConv, [512, 9]]
  - [[-1], 1, Concat, [1]] # 19
  - [-1, 1, Conv, [512, 1]] # 20
  - [[-1, 15], 1, Concat, [1]] # 21

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 22
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f_UIB, [256]] # 24

  - [21, 1, Conv, [512, 3, 2]] # 25
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f_UIB, [1024]] # 27

#-----------------------------------------------------------------

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-1, 1, Conv, [1024, 1]] # 29 P5
  - [21, 1, Conv, [512, 1]] # 30 P4
  - [24, 1, ADown, [256]] # P3
  - [[-1, 29, 30], 1, Concat, [1]] # 32
  - [-1, 1, DWConv, [512, 5]] 
  - [-2, 1, DWConv, [512, 7]]
  - [-3, 1, DWConv, [512, 9]]
  - [[-1], 1, Concat, [1]] # 36
  - [-1, 1, Conv, [512, 1]] # 37
  - [[-1, 32], 1, Concat, [1]] # 38

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 22], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f_UIB, [256]] # 41

  - [38, 1, Conv, [512, 3, 2]]
  - [[-1, 25], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f_UIB, [1024]] # 44

#------------------------------------------------------------------

  - [[41, 38, 44], 1, Detect, [nc]] # Detect(P3, P4, P5)
