# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# MASF-YOLO 网络配置（最终修正Neck结构顺序）

# 模型核心参数
nc: 1  # 类别数
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# 骨干网络（Backbone）：保持不变
backbone:
  - [-1, 1, CBS, [64, 3, 2]]  # 0: 初始卷积，输出64通道
  - [-1, 1, CBS, [128, 3, 2]]  # 1: 第二次卷积，输出128通道
  - [-1, 2, C3k2, [128, False, 0.25]]  # 2: C3k2模块，输出256通道
  - [-1, 1, MFAM, [128]] # 3: MFAM模块，增强特征
  
  - [-1, 1, CBS, [128, 3, 2]]  # 4: 卷积下采样，输出512通道
  - [-1, 2, C3k2, [256, False, 0.25]]  # 5: C3k2模块
  - [-1, 1, MFAM, [256]] # 6: MFAM模块
  
  - [-1, 1, CBS, [256, 3, 2]]  # 7: 卷积下采样，输出1024通道
  - [-1, 2, C3k2, [512, True]]  # 8: C3k2模块（带残差连接）
  - [-1, 1, MFAM, [512]]  # 9: MFAM模块
  
  - [-1, 1, CBS, [512, 3, 2]] # 10: 卷积下采样
  - [-1, 2, C3k2, [1024, True]]  # 11: C3k2模块
  - [-1, 1, SPPF, [1024, 5]]  # 12: SPPF多尺度池化
  - [-1, 2, C2PSA, [1024]]  # 13: C2PSA通道注意力
  - [-1, 1, MFAM, [1024]]  # 14: 最终MFAM特征增强

# 颈部网络（Neck）：严格按照 DASI→C3k2→IEMA→... 顺序
head:
  # 第一个 DASI→C3k2→IEMA 模块组
  - [[-1, 6, 9], 1, DASI, [1024, 512, 256, 512]]  # 15: DASI模块，输入1024，输出1024
  - [-1, 1, C3k2, [512, False]]  # 16: C3k2模块
  - [-1, 1, IEMA, [512, 512, 16]]  # 17: IEMA模块（多尺度注意力）
  
  # 第二个 DASI→C3k2→IEMA 模块组
  - [[-1, 3, 6], 1, DASI, [512, 256, 128, 256]]  # 18: DASI模块，输入512，输出512
  - [-1, 1, C3k2, [256, False]]  # 19: C3k2模块
  - [-1, 1, IEMA, [256, 128, 16]]  # 20: IEMA模块
  
  # 上采样 + 拼接 + C3k2 + IEMA
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 21: 上采样×2 输出128
  - [[-1, 3], 1, Concat, [1]]  # 22: 拼接第3层特征（128）
  - [-1, 1, C3k2, [256, False]]  # 23: C3k2模块
  - [-1, 1, IEMA, [256, 128, 16]]  # 24: IEMA模块
  
  # 拼接 + C3k2 + IEMA
  - [[-1, 3], 1, Concat, [1]]  # 25: 拼接第3层特征（128）
  - [-1, 1, C3k2, [256, False]]  # 26: C3k2模块
  - [-1, 1, IEMA, [256, 128, 16]]  # 27: IEMA模块
  
  # 卷积下采样 + 拼接 + C3k2 + IEMA
  - [-1, 1, CBS, [128, 3, 2]]  # 28: 卷积下采样，输出512
  - [[-1, 6], 1, Concat, [1]]  # 29: 拼接第6, 18层特征（256,512）
  - [-1, 1, C3k2, [512, False]]  # 30: C3k2模块
  - [-1, 1, IEMA, [512, 256, 16]]  # 31: IEMA模块
  
  # 卷积下采样 + 拼接 + C3k2 + IEMA
  - [-1, 1, CBS, [256, 3, 2]]  # 32: 卷积下采样，输出1024
  - [[-1, 16], 1, Concat, [1]]  # 33: 拼接第16层特征（1024），从模型上来看应该是拼接15的输出的，但是我输出的结果尺寸w，h不匹配
  - [-1, 1, C3k2, [1024, False]]  # 34: C3k2模块
  - [-1, 1, IEMA, [1024, 512, 16]]  # 35: IEMA模块
  
  # 卷积下采样 + 拼接 + C3k2 + IEMA
  - [-1, 1, CBS, [512, 3, 2]]  # 36: 卷积下采样，输出1024
  - [[-1, 14], 1, Concat, [1]]  # 37: 拼接第14层特征（IEMA-1024）
  - [-1, 1, C3k2, [2048, False]]  # 38: C3k2模块
  - [-1, 1, IEMA, [2048, 1024, 16]]  # 39: IEMA模块

  - [[27, 31, 35, 39], 1, Detect, [nc]]  # 40: 检测层（融合P3/P4/P5特征）
