# Ultralytics YOLO 🚀, AGPL-3.0 license
# GOLDYOLO object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/models/goldyolo

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple

# GOLDYOLOs backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, RepVGGBlock, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, RepVGGBlock, [128, 3, 2]]  # 1-P2/4
  - [-1, 6, RepBlock, [128]]
  - [-1, 1, RepVGGBlock, [256, 3, 2]]  # 3-P3/8
  - [-1, 12, RepBlock, [256]]
  - [-1, 1, RepVGGBlock, [512, 3, 2]]  # 5-P4/16
  - [-1, 18, RepBlock, [512]]
  - [-1, 1, RepVGGBlock, [1024, 3, 2]]  # 7-P5/32
  - [-1, 6, RepBlock, [1024]]
  - [-1, 1, SimSPPF, [1024, 5]]  # 9

# GOLDYOLOs head
head:
  - [[2, 4, 6, 9], 1, SimFusion_4in, []] # 10
  - [-1, 1, IFM, [[64, 32]]] # 11

  - [-1, 1, SimConv, [256, 1, 1]]
  - [[4, 6, -1], 1, SimFusion_3in, [256]]
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 0]]  # cat backbone P4
  - [-1, 12, RepBlock, [256]] # 15

  - [-1, 1, SimConv, [128, 1, 1]]
  - [[2, 4, -1], 1, SimFusion_3in, [128]]
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [128, [64, 32], 1]]  # cat backbone P3
  - [-1, 12, RepBlock, [128]] # 19

  - [[19, 15, 9], 1, PyramidPoolAgg, [352, 2]]
  - [-1, 1, TopBasicLayer, [352, [64, 128]]] # 21

  - [[19, 16], 1, AdvPoolFusion, []],
  - [[-1, 21], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]]  # cat head P4
  - [-1, 12, RepBlock, [256]] # 24

  - [[-1, 12], 1, AdvPoolFusion, []]
  - [[-1, 21], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]]  # cat head P5
  - [-1, 12, RepBlock, [512]] # 27

  - [19, 1, Conv, [128, 3, 1]]    #if use_dfl is False, please set reg_max to 0
  - [24, 1, Conv, [256, 3, 1]]
  - [27, 1, Conv, [512, 3, 1]]

  - [[28, 29, 30], 1, OBB, [nc, 1]]  # Detect(P3, P4, P5)
