# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect
 
# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 64]]  # 0-P2/4
  - [-1, 6, Light_HGBlock, [64, 128, 3]]  # stage 1
 
  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, Light_HGBlock, [128, 512, 3]]
  - [-1, 6, Light_HGBlock, [128, 512, 3, 3, True]]   # 4-stage 2
 
  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 5-P3/16
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, False]]  # cm, c2, k, light, shortcut
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, True]]
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, True]]
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, True]]
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, True]]  # 10-stage 3
 
  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 11-P4/32
  - [-1, 6, Light_HGBlock, [512, 2048, 5, 3, False]]
  - [-1, 6, Light_HGBlock, [512, 2048, 5, 3, True]]  # 13-stage 4
 
  - [-1, 1, SPPF, [1024, 5]] # 14
  - [-1, 1, PSA, [1024]] # 15
 
# YOLOv10.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 10], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 18
 
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 21 (P3/8-small)
 
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 24 (P4/16-medium)
 
  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]] # 27 (P5/32-large)
 
  - [[21, 24, 27], 1, v10Detect, [nc]] # Detect(P3, P4, P5)