# DAMO YOLO 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple

# DAMO YOLO backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, conv_bn_hswish, [16, 2]],                              # 0-p1/2

   [-1, 1, MobileNetV3_InvertedResidual, [16,  16, 3, 2, 1, 0]],  # 1-p2/4

   [-1, 1, MobileNetV3_InvertedResidual, [24,  72, 3, 2, 0, 0]],  # 2-p3/8
   [-1, 1, MobileNetV3_InvertedResidual, [24,  88, 3, 1, 0, 0]],  # 3

   [-1, 1, MobileNetV3_InvertedResidual, [40,  96, 5, 2, 1, 1]],  # 4-p4/16
   [-1, 1, MobileNetV3_InvertedResidual, [40, 240, 5, 1, 1, 1]],  # 5
   [-1, 1, MobileNetV3_InvertedResidual, [40, 240, 5, 1, 1, 1]],  # 6
   [-1, 1, MobileNetV3_InvertedResidual, [48, 120, 5, 1, 1, 1]],  # 7
   [-1, 1, MobileNetV3_InvertedResidual, [48, 144, 5, 1, 1, 1]],  # 8

   [-1, 1, MobileNetV3_InvertedResidual, [96, 288, 5, 2, 1, 1]],  # 9-p5/32
   [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 1, 1, 1]],  # 10
   [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 1, 1, 1]],  # 11

   [-1, 1, SPPF, [1024, 5]],  # 12
  ]
        
# DAMO YOLO GFPN Head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 13
   [8, 1, Conv, [512, 3, 2]],
   [[-1, 13], 1, Concat, [1]],
   [-1, 3, CSPStage, [512]], # 16

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #17
   [3, 1, Conv, [256, 3, 2]], # 18
   [[17, -1, 8], 1, Concat, [1]],
   [-1, 3, CSPStage, [512]], # 20

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],
   [-1, 3, CSPStage, [256]], # 23

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 20], 1, Concat, [1]],
   [-1, 3, CSPStage, [512]], # 26

   [20, 1, Conv, [256, 3, 2]], # 27
   [26, 1, Conv, [256, 3, 2]], # 28
   [[16, 27, -1], 1, Concat, [1]],
   [-1, 3, CSPStage, [1024]], # 30

   [[23, 26, 30], 1, Detect, [nc]],  # Detect(P3, P4, P5)
  ]