# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
  t: [0.33, 0.375, 1024, 0]
  s: [0.33, 0.50, 1024, 0]
  m: [0.67, 0.75, 768, 0]
  l: [1.00, 1.00, 512, 0]
  x: [1.00, 1.25, 512, 0]

# ParCNetV2-Tiny
backbone:
  # [from, repeats, module, args]
  # args format for ParCDown: [out_channels, kernel, stride]
  # args format for ParCBlock: [out_channels, global_kernel_size] 
  # 注意: ParCBlock 的 out_channels 必須等於上一層的輸出，這裡顯式寫出是為了 parse_model 計算

  # Stage 0 (Stem)
  # Input: 3 -> Output: 64. Kernel=7, Stride=4
  - [-1, 1, ParCDown, [64, 7, 4]]  # 0-P1/4

  # Stage 0 Blocks
  # Repeats=3 (depths[0]), Dim=64, GlobalK=111
  - [-1, 3, ParCBlock, [64, 111]]  # 1

  # Stage 1 Downsample
  # Input: 64 -> Output: 128. Kernel=3, Stride=2
  - [-1, 1, ParCDown, [128, 3, 2]]  # 2-P2/8

  # Stage 1 Blocks
  # Repeats=3 (depths[1]), Dim=128, GlobalK=55
  - [-1, 9, ParCBlock, [128, 55]]   # 3

  # Stage 2 Downsample
  # Input: 128 -> Output: 320. Kernel=3, Stride=2
  - [-1, 1, ParCDown, [320, 3, 2]]  # 4-P3/16

  # Stage 2 Blocks
  # Repeats=12 (depths[2]), Dim=320, GlobalK=27
  - [-1, 24, ParCBlock, [320, 27]]  # 5

  # Stage 3 Downsample
  # Input: 320 -> Output: 512. Kernel=3, Stride=2
  - [-1, 1, ParCDown, [512, 3, 2]]  # 6-P4/32

  # Stage 3 Blocks
  # Repeats=3 (depths[3]), Dim=512, GlobalK=13
  - [-1, 3, ParCBlock, [512, 13]]   # 7

  - [-1, 1, SPPF, [512, 5]] # 8

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)