# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Modified YOLO11 for 50-70% faster inference
# Optimized for speed with minimal accuracy loss

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  # AGGRESSIVE reduction for 50-70% speedup
  n: [0.25, 0.15, 512]   # Depth: 0.50->0.25 (50% less), Width: 0.25->0.15 (40% less), Max: 1024->512 (50% less)
  s: [0.25, 0.25, 512]   # Significantly reduced
  m: [0.25, 0.50, 384]   # Very aggressive reduction
  l: [0.33, 0.50, 384]   # Major reduction
  x: [0.33, 0.75, 384]   # Substantial reduction

# YOLO11n ultra-fast backbone - AGGRESSIVE optimization
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]     # 0-P1/2 (MAJOR reduction: 64->32, 50% less)
  - [-1, 1, Conv, [64, 3, 2]]     # 1-P2/4 (MAJOR reduction: 128->64, 50% less)
  # REMOVE one C3k2 layer entirely for speed
  - [-1, 1, Conv, [128, 3, 2]]    # 2-P3/8 (skip C3k2, direct conv, 256->128)
  - [-1, 1, C3k2, [256, False, 0.25]]  # 3 (reduced: 512->256, 50% less channels)
  - [-1, 1, Conv, [256, 3, 2]]    # 4-P4/16 (MAJOR reduction: 512->256, 50% less)
  # REMOVE one C3k2 layer entirely
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P5/32 (MAJOR reduction: 1024->512, 50% less)
  - [-1, 1, C3k2, [512, True]]    # 6 (only 1 C3k2 in backbone)
  - [-1, 1, SPPF, [512, 5]]       # 7 (MAJOR reduction: 1024->512)
  # REMOVE C2PSA entirely - too expensive

# YOLO11n ultra-fast head - AGGRESSIVE optimization
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]     # cat backbone P4 (adjusted index)
  - [-1, 1, C3k2, [256, False]]   # 10 (REMOVE repeats entirely, just 1 layer)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]     # cat backbone P3 (adjusted index)
  - [-1, 1, C3k2, [128, False]]   # 13 P3/8-small (MAJOR reduction: 1 layer only, 256->128)
  - [-1, 1, Conv, [128, 3, 2]]    # (MAJOR reduction: 256->128)
  - [[-1, 10], 1, Concat, [1]]    # cat head P4
  - [-1, 1, C3k2, [256, False]]   # 16 P4/16-medium (1 layer only, 512->256)
  - [-1, 1, Conv, [256, 3, 2]]    # (MAJOR reduction: 512->256)
  - [[-1, 7], 1, Concat, [1]]     # cat head P5 (adjusted index)
  - [-1, 1, C3k2, [512, True]]    # 19 P5/32-large (1 layer only, 1024->512)
  - [[13, 16, 19], 1, Detect, [nc]] # Detect(P3, P4, P5) (adjusted indices)