# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv7 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
activation: nn.LeakyReLU(0.1) # (optional) model default activation function
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
 
# yolov7 backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 1]],  # 0
 
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],
 
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   # c2, in_c, k=1, s=1, p=None, g=1, layer=[], backbone=True, act=True
   [-1, 1, Yolov7_E_ELAN, [256, 64, 1, 1, None, 1, [-1, -3, -5, -6]]], # 4
 
   [-1, 1, V7DownSampling, [256, 1, 1]], # 5-P3/8
   [-1, 1, Yolov7_E_ELAN, [512, 128, 1, 1, None, 1, [-1, -3, -5, -6]]],  # 6
 
   [-1, 1, V7DownSampling, [512, 1, 1]], # 7-P4/16
   [-1, 1, Yolov7_E_ELAN, [1024, 256, 1, 1, None, 1, [-1, -3, -5, -6]]], # 8
 
   [-1, 1, V7DownSampling, [1024, 1, 1]], # 9-P5/32
   [-1, 1, Yolov7_E_ELAN, [1024, 256, 1, 1, None, 1, [-1, -3, -5, -6]]], # 10
 
  ]
 
# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 11
 
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [8, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
 
   [-1, 1, Yolov7_E_ELAN, [256, 128, 1, 1, None, 1, [-1, -2, -3, -4, -5, -6], False]], # 16
 
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Yolov7_E_ELAN, [128, 64, 1, 1, None, 1, [-1, -2, -3, -4, -5, -6], False]], # 21
 
   [-1, 1, V7DownSampling, [256, 1, 1]],
   [[-1, 16], 1, Concat, [1]],
   [-1, 1, Yolov7_E_ELAN, [256, 128, 1, 1, None, 1, [-1, -2, -3, -4, -5, -6], False]], # 24
 
   [-1, 1, V7DownSampling, [512, 1, 1]],
   [[-1, 11], 1, Concat, [1]],
   [-1, 1, Yolov7_E_ELAN, [512, 256, 1, 1, None, 1, [-1, -2, -3, -4, -5, -6], False]], # 27
 
   [21, 1, RepConv_v7, [256, 3, 1]],
   [24, 1, RepConv_v7, [512, 3, 1]],
   [27, 1, RepConv_v7, [1024, 3, 1]],
 
   [[28, 29, 30], 1, ISegment, [nc, 32, 256]],   # Detect(P3, P4, P5)
  ]