# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
  t: [0.33, 0.375, 1024, 0]
  s: [0.33, 0.50, 1024, 0]
  m: [0.67, 0.75, 768, 0]
  l: [1.00, 1.00, 512, 0]
  x: [1.00, 1.25, 512, 0]

# MogaNet-Tiny backbone
# embed_dims: [64, 160, 320, 640]
# depths: [4, 6, 44, 4]
backbone:
  # [from, repeats, module, args]
  # args: [out_channels, ...] 
  
  # Stage 1
  # Input: 3 channel image
  - [-1, 1, StackConvPatchEmbed, [64, 3, 2]] # 0: out=32. P1/2 (Resolution / 2)
  - [-1, 1, MogaStage, [64, 4]]              # 1: out=32, depth=3

  # Stage 2
  - [-1, 1, ConvPatchEmbed, [160, 3, 2]]      # 2: out=64. P2/4
  - [-1, 1, MogaStage, [160, 6]]              # 3: out=64, depth=3

  # Stage 3
  - [-1, 1, ConvPatchEmbed, [320, 3, 2]]     # 4: out=128. P3/8
  - [-1, 1, MogaStage, [320, 44]]            # 5: out=128, depth=12

  # Stage 4
  - [-1, 1, ConvPatchEmbed, [640, 3, 2]]     # 6: out=256. P4/16
  - [-1, 1, MogaStage, [640, 4]]             # 7: out=256, depth=2

  # 8. SPPF (YOLO standard head enhancement)
  - [-1, 1, SPPF, [640, 5]] # 8

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)