# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# ResNet18-PST classification model
# Parameters
nc: 1000 # number of classes
scales:
  n: [0.50, 0.25, 1024, 0]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]] # 0-P1/2
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 2]] # 1-P2/4
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 2]] # 2-P3/8
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 2]] # 3-P4/16
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 2]] # 4-P5/32
  - [[3, -1], 2, 'PST', [1024, 2, 0.5]] 
  - [[-1, 3], 1, 'Concat', [1]]
  - [-1, 1, 'Conv', [1024, 3, 2]] # 7-P5/32
  - [[-1, 4], 1, 'Concat', [1]]
  - [-1, 2, 'Conv', [1024, 1, 1]]
# CLS head
head:
  - [-1, 1, Classify, [nc]] # Classify
