# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOX object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.375  # layer channel multiple

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [768, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [768]],
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P6/64
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 11
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [768, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P5
   [-1, 3, C3, [768, False]],  # 15

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 19

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 23 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 20], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 26 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [768, False]],  # 29 (P5/32-large)

   [-1, 1, Conv, [768, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P6
   [-1, 3, C3, [1024, False]],  # 32 (P6/64-xlarge)

# yolox head
   [23, 1, Conv, [256, 1, 1]],  # 33 lateral0 (P3/8-small)
   [26, 1, Conv, [256, 1, 1]],  # 34 lateral1 (P4/16-medium)
   [29, 1, Conv, [256, 1, 1]],  # 35 lateral2 (P5/32-large)
   [32, 1, Conv, [256, 1, 1]],  # 36 lateral2 (P6/64-xlarge)

   [33, 2, Conv, [256, 3, 1]],  # 37 cls0 (P3/8-small)
   [33, 2, Conv, [256, 3, 1]],  # 38 reg0 (P3/8-small)

   [34, 2, Conv, [256, 3, 1]],  # 39 cls1 (P4/16-medium)
   [34, 2, Conv, [256, 3, 1]],  # 40 reg1 (P4/16-medium)

   [35, 2, Conv, [256, 3, 1]],  # 41 cls2 (P5/32-large)
   [35, 2, Conv, [256, 3, 1]],  # 42 reg2 (P5/32-large)

   [36, 2, Conv, [256, 3, 1]],  # 43 cls2 (P6/64-xlarge)
   [36, 2, Conv, [256, 3, 1]],  # 44 reg2 (P6/64-xlarge)

    [[37, 38, 39, 40, 41, 42, 43, 44], 1, Segment, [nc, 32, 256]],  # Detect(P3, P4, P5)
  ]
