# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11-cls-PST image classification model

# Parameters
nc: 1000 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-cls-pst.yaml' will call yolo12-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] 
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]

# YOLO11n-pst backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, 'Conv', [64, 3, 2]]
  - [-1, 1, 'Conv', [128, 3, 2]]
  - [-1, 2, 'C3k2', [256, False, 0.25]]
  - [-1, 1, 'Conv', [256, 3, 2]]
  - [-1, 2, 'C3k2', [512, False, 0.25]]
  - [-1, 1, 'Conv', [512, 3, 2]]
  - [-1, 2, 'C3k2', [512, True]]
  - [-1, 1, 'Conv', [1024, 3, 2]]
  - [[6, -1], 2, 'PST', [1024, 2, 0.5]]
  - [[-1, 6], 1, 'Concat', [1]]
  - [-1, 1, 'Conv', [1024, 3, 2]]
  - [[-1, 7], 1, 'Concat', [1]]
  - [-1, 2, 'C3k2', [1024, True]]
  - [-1, 2, 'C2PSA', [1024]]
# CLS head
head:
  - [-1, 1, Classify, [nc]] # Classify
