# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
  t: [0.33, 0.375, 1024, 0]
  s: [0.33, 0.50, 1024, 0]
  m: [0.67, 0.75, 768, 0]
  l: [1.00, 1.00, 512, 0]
  x: [1.00, 1.25, 512, 0]

# vHeat-Tiny backbone
# Dims: [96, 192, 384, 768]
# Depths: [2, 2, 6, 2]
backbone:
  # [from, repeats, module, args]
  # args for vHeatStage: [out_channels, init_resolution]
  
  # Stem: Input(3) -> Output(96), Stride 4. Level P2.
  - [-1, 1, vHeatStem, [128]]  # 0-P2/4
  
  # Stage 1: Dim 96, Depth 2, Res 56
  - [-1, 2, vHeatStage, [128, 56]] # 1
  
  # Downsample: 96 -> 192. Level P3.
  - [-1, 1, vHeatDownsample, [256]] # 2-P3/8
  
  # Stage 2: Dim 192, Depth 2, Res 28
  - [-1, 2, vHeatStage, [256, 28]] # 3
  
  # Downsample: 192 -> 384. Level P4.
  - [-1, 1, vHeatDownsample, [512]] # 4-P4/16
  
  # Stage 3: Dim 384, Depth 6, Res 14
  - [-1, 18, vHeatStage, [512, 14]] # 5
  
  # Downsample: 384 -> 768. Level P5.
  - [-1, 1, vHeatDownsample, [1024]] # 6-P5/32
  
  # Stage 4: Dim 768, Depth 2, Res 7
  - [-1, 2, vHeatStage, [1024, 7]] # 7

  - [-1, 1, SPPF, [1024, 5]] # 8

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)