# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv5 object detection model with P3-P6 outputs. For details see https://docs.ultralytics.com/models/yolov5

# Parameters
nc: 80  # number of classes
kpt_shape: [17, 3]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov5n-p6.yaml' will call yolov5-p6.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
  t: [0.33, 0.375, 1024, 0]
  s: [0.33, 0.50, 1024, 0]
  m: [0.67, 0.75, 1024, 0]
  l: [1.00, 1.00, 1024, 0]
  x: [1.33, 1.25, 1024, 0]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 1, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 3, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 3, C3, [512]],
   [-1, 1, Conv, [768, 3, 2]],  # 7-P5/32
   [-1, 1, C3, [768]],
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P6/64
   [-1, 1, SPPF, [1024, 5]],  
   [-1, 1, C3TR, [1024]],  # 11
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [768, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P5
   [-1, 1, C3, [768, False]],  # 15

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C3, [512, False]],  # 19

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [256, False]],  # 23 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [128, False]],  # 27 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 4], 1, Concat, [1]],  # cat head P4
   [-1, 1, SPPF, [256, 5]],
   [-1, 1, C3, [256, False]],  # 31 (P4/16-medium)
   [-1, 1, CBAM, [256]], # 32

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 6, 20], 1, Concat, [1]],  # cat head P4
   [-1, 1, SPPF, [512, 5]],
   [-1, 1, C3, [512, False]],  # 36 (P4/16-medium)
   [-1, 1, CBAM, [512]], # 37

   [-1, 1, Conv, [768, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P4
   [-1, 1, SPPF, [768, 5]],
   [-1, 1, C3, [768, False]],  # 41 (P4/16-medium)
   [-1, 1, CBAM, [768]], # 42

   [-1, 1, Conv, [1024, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P4
   [-1, 1, SPPF, [1024, 5]],
   [-1, 1, C3, [1024, False]],  # 46 (P4/16-medium)
   [-1, 1, CBAM, [1024]], # 47

   [[32, 37, 42, 47], 1, Pose, [nc, kpt_shape]],  # Detect(P3, P4, P5, P6)
  ]
