# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# ResNet101-PST object detection model with P3/8 - P5/32 outputs

# Parameters
nc: 80 # number of classes
scales:
  s: [0.50, 0.50, 1024, 0]

backbone:
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]] # 0-P1/2
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]] # 1-P2/4
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]] # 2-P3/8
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 23]] # 3-P4/16
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]] # 4-P5/32
  - [-1, 1, Conv, [1024, 1, 1]]                # 5
  - [-1, 4, A2C2f, [1024, True, 1]]            # 6

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 7
  - [[-1, 3], 1, Concat, [1]]                  # # cat backbone P4
  - [[-1, 6], 2, PST, [512, 2, 0.5]]        # 9: P3

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10
  - [[-1, 2], 1, Concat, [1]]                  # cat backbone P3
  - [[-1, 3], 2, PST, [256, 2, 0.5]]        # 12

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 15

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 6], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 18 (P5/32-large)

  - [[12, 15, 18], 1, Detect, [nc]] # Detect(P3, P4, P5)
