# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv6 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/models/yolov6

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov6n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
  t: [0.33, 0.375, 1024, 0]
  s: [0.33, 0.50, 1024, 0]
  m: [0.67, 0.75, 768, 0]
  l: [1.00, 1.00, 512, 0]
  x: [1.00, 1.25, 512, 0]

# YOLOv6-4.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, RepVGGBlock, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, RepVGGBlock, [128, 3, 2]]  # 1-P2/4
  - [-1, 6, RepBlock, [128]]
  - [-1, 1, RepVGGBlock, [256, 3, 2]]  # 3-P3/8
  - [-1, 12, RepBlock, [256]]
  - [-1, 1, RepVGGBlock, [512, 3, 2]]  # 5-P4/16
  - [-1, 18, RepBlock, [512]]
  - [-1, 1, RepVGGBlock, [768, 3, 2]]  # 7-P5/32
  - [-1, 6, RepBlock, [768]]
  - [-1, 1, RepVGGBlock, [1024, 3, 2]]  # 9-P6/32
  - [-1, 6, RepBlock, [1024]]
  - [-1, 1, RepVGGBlock, [1280, 3, 2]]  # 11-P7/32
  - [-1, 6, RepBlock, [1280]]
  - [-1, 1, SimSPPF, [1280, 5]]  # 13

# YOLOv6-4.0s head
head:
  - [-1, 1, SimConv, [512, 1, 1]]
  - [-1, 1, Transpose, [512]]
  - [[-1, 10], 1, Concat, [1]]  
  - [-1, 14, RepBlock, [512]] # 17

  - [-1, 1, SimConv, [384, 1, 1]]
  - [-1, 1, Transpose, [384]]
  - [[-1, 8], 1, Concat, [1]]  
  - [-1, 14, RepBlock, [384]] # 21

  - [-1, 1, SimConv, [256, 1, 1]]
  - [-1, 1, Transpose, [256]]
  - [[-1, 6], 1, Concat, [1]]  
  - [-1, 14, RepBlock, [256]] # 25

  - [-1, 1, SimConv, [128, 1, 1]]
  - [-1, 1, Transpose, [128]]
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 14, RepBlock, [128]] # 29

  - [-1, 1, SimConv, [128, 3, 2]]
  - [[-1, 26], 1, Concat, [1]]  
  - [-1, 14, RepBlock, [256]] # 32

  - [-1, 1, SimConv, [256, 3, 2]]
  - [[-1, 22], 1, Concat, [1]]  
  - [-1, 14, RepBlock, [384]] # 35

  - [-1, 1, SimConv, [384, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]  
  - [-1, 14, RepBlock, [512]] # 38

  - [-1, 1, SimConv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  
  - [-1, 14, RepBlock, [640]] # 41

  - [29, 1, Conv, [128, 3, 1]]  # 42  #if use_dfl is False, please set reg_max to 0
  - [32, 1, Conv, [256, 3, 1]]  # 43
  - [35, 1, Conv, [384, 3, 1]]  # 44
  - [38, 1, Conv, [512, 3, 1]]  # 45
  - [41, 1, Conv, [640, 3, 1]]  # 46

  - [[42, 43, 44, 45, 46], 1, OBB, [nc, 1]]  # Detect(P3, P4, P5)
